In [3]:
import pandas as pd

data = pd.read_csv("pandas_file_usr_data.csv")
print(data)
print(data.head(15))       #starting ki 15 values print hogi
print(data.tail(15))       #last ki 15 values print krwa dega

     Index   Height(Inches)"   "Weight(Pounds)"
0        1             65.78             112.99
1        2             71.52             136.49
2        3             69.40             153.03
3        4             68.22             142.34
4        5             67.79             144.30
..     ...               ...                ...
195    196             65.80             120.84
196    197             66.11             115.78
197    198             68.24             128.30
198    199             68.02             127.47
199    200             71.39             127.88

[200 rows x 3 columns]
    Index   Height(Inches)"   "Weight(Pounds)"
0       1             65.78             112.99
1       2             71.52             136.49
2       3             69.40             153.03
3       4             68.22             142.34
4       5             67.79             144.30
5       6             68.70             123.30
6       7             69.80             141.49
7       8             70.01             136.46
8       9             67.90             112.37
9      10             66.78             120.67
10     11             66.49             127.45
11     12             67.62             114.14
12     13             68.30             125.61
13     14             67.12             122.46
14     15             68.28             116.09
     Index   Height(Inches)"   "Weight(Pounds)"
185    186             65.96             129.15
186    187             68.58             127.87
187    188             66.59             120.92
188    189             66.97             127.65
189    190             68.08             101.47
190    191             70.19             144.99
191    192             65.52             110.95
192    193             67.46             132.86
193    194             67.41             146.34
194    195             69.66             145.59
195    196             65.80             120.84
196    197             66.11             115.78
197    198             68.24             128.30
198    199             68.02             127.47
199    200             71.39             127.88

In [4]:
print(data.info())     #returns the information of data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Index              200 non-null    int64
 1    Height(Inches)"   200 non-null    float64
 2    "Weight(Pounds)"  200 non-null    float64
dtypes: float64(2), int64(1)
memory usage: 4.8 KB
None

In [5]:
print(data.describe())     #returns mean, std deviation , max, min, etc

            Index   Height(Inches)"   "Weight(Pounds)"
count  200.000000        200.000000         200.000000
mean   100.500000         67.949800         127.221950
std     57.879185          1.940363          11.960959
min      1.000000         63.430000          97.900000
25%     50.750000         66.522500         119.895000
50%    100.500000         67.935000         127.875000
75%    150.250000         69.202500         136.097500
max    200.000000         73.900000         158.960000

In [6]:
   print(data.isnull()).  #jaha jaha null value h waha true aa jayega

     Index   Height(Inches)"   "Weight(Pounds)"
0    False             False              False
1    False             False              False
2    False             False              False
3    False             False              False
4    False             False              False
..     ...               ...                ...
195  False             False              False
196  False             False              False
197  False             False              False
198  False             False              False
199  False             False              False

[200 rows x 3 columns]

In [7]:
print(data.isnull().sum())  #column wise null value dikayega (jis column m null value hogi uske aage  number bta dega)
#isme Index, Height,Weight columns m 0 null values h

Index                0
 Height(Inches)"     0
 "Weight(Pounds)"    0
dtype: int64

In [22]:
#new excel file having 1000 rows
!pip install xlrd
import pandas as pd
data1 = pd.read_excel("XL_File_pandas_1000.xls")
print(data1.head(15))

Requirement already satisfied: xlrd in /opt/anaconda3/lib/python3.13/site-packages (2.0.2)
    Unnamed: 0 First Name  Last Name  Gender        Country  Age        Date  \
0            1      Dulce      Abril  Female  United States   32  15/10/2017
1            2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016
2            3     Philip       Gent    Male         France   36  21/05/2015
3            4   Kathleen     Hanner  Female  United States   25  15/10/2017
4            5    Nereida    Magwood  Female  United States   58  16/08/2016
5            6     Gaston      Brumm    Male  United States   24  21/05/2015
6            7       Etta       Hurn  Female  Great Britain   56  15/10/2017
7            8    Earlean     Melgar  Female  United States   27  16/08/2016
8            9   Vincenza    Weiland  Female  United States   40  21/05/2015
9           10     Fallon    Winward  Female  Great Britain   28  16/08/2016
10          11    Arcelia     Bouska  Female  Great Britain   39  21/05/2015
11          12   Franklyn     Unknow    Male         France   38  15/10/2017
12          13    Sherron   Ascencio  Female  Great Britain   32  16/08/2016
13          14     Marcel  Zabriskie    Male  Great Britain   26  21/05/2015
14          15       Kina   Hazelton  Female  Great Britain   31  16/08/2016

      Id
0   1562
1   1582
2   2587
3   3549
4   2468
5   2554
6   3598
7   2456
8   6548
9   5486
10  1258
11  2579
12  3256
13  2587
14  3259

In [19]:
print(data1["Country"].duplicated())     #return true in the columns where data is duplicate
(data1["Country"].duplicated().sum())    #return

0      False
1      False
2      False
3       True
4       True
       ...
995     True
996     True
997     True
998     True
999     True
Name: Country, Length: 1000, dtype: bool

np.int64(997)

In [24]:
print(data1.drop_duplicates("Id"))    #remove all the duplicates from the Id column
#exapmle k liye because:- employee i kisi bhi employee ki samne nhi honi chahiye(name,country, surname same ho skta h)

    Unnamed: 0 First Name   Last Name  Gender        Country  Age        Date  \
0            1      Dulce       Abril  Female  United States   32  15/10/2017
1            2       Mara   Hashimoto  Female  Great Britain   25  16/08/2016
2            3     Philip        Gent    Male         France   36  21/05/2015
3            4   Kathleen      Hanner  Female  United States   25  15/10/2017
4            5    Nereida     Magwood  Female  United States   58  16/08/2016
5            6     Gaston       Brumm    Male  United States   24  21/05/2015
6            7       Etta        Hurn  Female  Great Britain   56  15/10/2017
7            8    Earlean      Melgar  Female  United States   27  16/08/2016
8            9   Vincenza     Weiland  Female  United States   40  21/05/2015
9           10     Fallon     Winward  Female  Great Britain   28  16/08/2016
10          11    Arcelia      Bouska  Female  Great Britain   39  21/05/2015
11          12   Franklyn      Unknow    Male         France   38  15/10/2017
12          13    Sherron    Ascencio  Female  Great Britain   32  16/08/2016
14          15       Kina    Hazelton  Female  Great Britain   31  16/08/2016
15          16   Shavonne         Pia  Female         France   24  21/05/2015
16          17     Shavon      Benito  Female         France   39  15/10/2017
17          18   Lauralee     Perrine  Female  Great Britain   28  16/08/2016
18          19     Loreta      Curren  Female         France   26  21/05/2015
19          20     Teresa      Strawn  Female         France   46  21/05/2015
20          21    Belinda     Partain  Female  United States   37  15/10/2017
21          22      Holly        Eudy  Female  United States   52  16/08/2016
22          23       Many      Cuccia  Female  Great Britain   46  21/05/2015
24          25     Lester     Prothro    Male         France   21  15/10/2017
25          26     Marvel        Hail  Female  Great Britain   28  16/08/2016
26          27    Angelyn        Vong  Female  United States   29  21/05/2015
27          28  Francesca   Beaudreau  Female         France   23  15/10/2017
29          30      Carla    Trumbull  Female  Great Britain   28  21/05/2015
30          31       Veta       Muntz  Female  Great Britain   37  15/10/2017
31          32     Stasia      Becker  Female  Great Britain   34  16/08/2016
32          33       Jona     Grindle  Female  Great Britain   26  21/05/2015
33          34      Judie    Claywell  Female         France   35  16/08/2016
34          35     Dewitt      Borger    Male  United States   36  21/05/2015
35          36       Nena      Hacker  Female  United States   29  15/10/2017
36          37     Kelsie     Wachtel  Female         France   27  16/08/2016
37          38        Sau        Pfau  Female  United States   25  21/05/2015
38          39    Shanice   Mccrystal  Female  United States   36  21/05/2015
39          40      Chase      Karner    Male  United States   37  15/10/2017
40          41     Tommie   Underdahl    Male  United States   26  16/08/2016
41          42     Dorcas      Darity  Female  United States   37  21/05/2015
43          44  Willodean        Harn  Female  United States   39  16/08/2016
44          45     Weston     Martina    Male  United States   26  21/05/2015
45          46       Roma  Lafollette  Female  United States   34  15/10/2017
46          47     Felisa        Cail  Female  United States   28  16/08/2016

      Id
0   1562
1   1582
2   2587
3   3549
4   2468
5   2554
6   3598
7   2456
8   6548
9   5486
10  1258
11  2579
12  3256
14  3259
15  1546
16  3579
17  6597
18  9654
19  3569
20  2564
21  8561
22  5489
24  6574
25  5555
26  6125
27  5412
29  3264
30  4569
31  7521
32  6458
33  7569
34  8514
35  8563
36  8642
37  9536
38  2567
39  2154
40  3265
41  8765
43  3567
44  6540
45  2654
46  6525

In [27]:
 print(data1.isnull())         #returns true to all the null values in the data
 print(data1.isnull().sum())    #returns in numeric all the null values in the columns
#there is no null value in the data because it shows false or 0

     Unnamed: 0  First Name  Last Name  Gender  Country    Age   Date     Id
0         False       False      False   False    False  False  False  False
1         False       False      False   False    False  False  False  False
2         False       False      False   False    False  False  False  False
3         False       False      False   False    False  False  False  False
4         False       False      False   False    False  False  False  False
..          ...         ...        ...     ...      ...    ...    ...    ...
995       False       False      False   False    False  False  False  False
996       False       False      False   False    False  False  False  False
997       False       False      False   False    False  False  False  False
998       False       False      False   False    False  False  False  False
999       False       False      False   False    False  False  False  False

[1000 rows x 8 columns]
Unnamed: 0    0
First Name    0
Last Name     0
Gender        0
Country       0
Age           0
Date          0
Id            0
dtype: int64

In [28]:
print(data1.dropna())   #deletes all the null values

     Unnamed: 0 First Name   Last Name  Gender        Country  Age  \
0             1      Dulce       Abril  Female  United States   32
1             2       Mara   Hashimoto  Female  Great Britain   25
2             3     Philip        Gent    Male         France   36
3             4   Kathleen      Hanner  Female  United States   25
4             5    Nereida     Magwood  Female  United States   58
..          ...        ...         ...     ...            ...  ...
995         996       Roma  Lafollette  Female  United States   34
996         997     Felisa        Cail  Female  United States   28
997         998   Demetria       Abbey  Female  United States   32
998         999     Jeromy        Danz    Male  United States   39
999        1000   Rasheeda      Alkire  Female  United States   29

           Date    Id
0    15/10/2017  1562
1    16/08/2016  1582
2    21/05/2015  2587
3    15/10/2017  3549
4    16/08/2016  2468
..          ...   ...
995  15/10/2017  2654
996  16/08/2016  6525
997  21/05/2015  3265
998  15/10/2017  3265
999  16/08/2016  6125

[1000 rows x 8 columns]

In [38]:
print(data1)
import numpy as np
print(data1.replace("United States", "US"))  #replace all unites states as US
#if we ony want to replace in a particular column(suppose we want to conert Unites states to us only in country column the
data1["Country"] = data1["Country"].replace("United States", "US")
print(data1.columns)

     Unnamed: 0 First Name   Last Name  Gender        Country  Age  \
0             1      Dulce       Abril  Female             US   32
1             2       Mara   Hashimoto  Female  Great Britain   25
2             3     Philip        Gent    Male         France   36
3             4   Kathleen      Hanner  Female             US   25
4             5    Nereida     Magwood  Female             US   58
..          ...        ...         ...     ...            ...  ...
995         996       Roma  Lafollette  Female             US   34
996         997     Felisa        Cail  Female             US   28
997         998   Demetria       Abbey  Female             US   32
998         999     Jeromy        Danz    Male             US   39
999        1000   Rasheeda      Alkire  Female             US   29

           Date    Id
0    15/10/2017  1562
1    16/08/2016  1582
2    21/05/2015  2587
3    15/10/2017  3549
4    16/08/2016  2468
..          ...   ...
995  15/10/2017  2654
996  16/08/2016  6525
997  21/05/2015  3265
998  15/10/2017  3265
999  16/08/2016  6125

[1000 rows x 8 columns]
     Unnamed: 0 First Name   Last Name  Gender        Country  Age  \
0             1      Dulce       Abril  Female             US   32
1             2       Mara   Hashimoto  Female  Great Britain   25
2             3     Philip        Gent    Male         France   36
3             4   Kathleen      Hanner  Female             US   25
4             5    Nereida     Magwood  Female             US   58
..          ...        ...         ...     ...            ...  ...
995         996       Roma  Lafollette  Female             US   34
996         997     Felisa        Cail  Female             US   28
997         998   Demetria       Abbey  Female             US   32
998         999     Jeromy        Danz    Male             US   39
999        1000   Rasheeda      Alkire  Female             US   29

           Date    Id
0    15/10/2017  1562
1    16/08/2016  1582
2    21/05/2015  2587
3    15/10/2017  3549
4    16/08/2016  2468
..          ...   ...
995  15/10/2017  2654
996  16/08/2016  6525
997  21/05/2015  3265
998  15/10/2017  3265
999  16/08/2016  6125

[1000 rows x 8 columns]
Index(['Unnamed: 0', 'First Name', 'Last Name', 'Gender', 'Country', 'Age',
       'Date', 'Id'],
      dtype='object')

In [ ]:
#print(data.fillna(method = "bfill")) # backward fill the null values
#print(data.fillna(method = "ffill")) # forward fill the null values